grevaillot/svd_tools/headers/ATSAMR34J18B/tcc2.h
#define TCC2_CTRLA_PRESCSYNC_SHIFT		12
#define TCC2_CTRLA_PRESCSYNC_MASK		0x03
/** @defgroup tcc2_ctrla_prescsync PRESCSYNC Prescaler and Counter Synchronization Selection
@{*/
/**@}*/

/** TCC2_CTRLA_RUNSTDBY Run in Standby **/
#define TCC2_CTRLA_RUNSTDBY		(1 << 11)

#define TCC2_CTRLA_PRESCALER_SHIFT		8
#define TCC2_CTRLA_PRESCALER_MASK		0x07
/** @defgroup tcc2_ctrla_prescaler PRESCALER Prescaler
@{*/
/**@}*/


#define TCC2_CTRLA_RESOLUTION_SHIFT		5
#define TCC2_CTRLA_RESOLUTION_MASK		0x03
/** @defgroup tcc2_ctrla_resolution RESOLUTION Enhanced Resolution
@{*/
/**@}*/

/** TCC2_CTRLA_ENABLE Enable **/
#define TCC2_CTRLA_ENABLE		(1 << 1)
/** TCC2_CTRLA_SWRST Software Reset **/
#define TCC2_CTRLA_SWRST		(1 << 0)

/**@}*/

/** @defgroup tcc2_ctrlbclr CTRLBCLR Control B Clear
@{*/


#define TCC2_CTRLBCLR_CMD_SHIFT		5
#define TCC2_CTRLBCLR_CMD_MASK		0x07
/** @defgroup tcc2_ctrlbclr_cmd CMD TCC Command
@{*/
/**@}*/


#define TCC2_CTRLBCLR_IDXCMD_SHIFT		3
#define TCC2_CTRLBCLR_IDXCMD_MASK		0x03
/** @defgroup tcc2_ctrlbclr_idxcmd IDXCMD Ramp Index Command
@{*/
/**@}*/

/** TCC2_CTRLBCLR_ONESHOT One-Shot **/
#define TCC2_CTRLBCLR_ONESHOT		(1 << 2)
/** TCC2_CTRLBCLR_LUPD Lock Update **/
#define TCC2_CTRLBCLR_LUPD		(1 << 1)
/** TCC2_CTRLBCLR_DIR Counter Direction **/
#define TCC2_CTRLBCLR_DIR		(1 << 0)

/**@}*/

/** @defgroup tcc2_ctrlbset CTRLBSET Control B Set
@{*/


#define TCC2_CTRLBSET_CMD_SHIFT		5
#define TCC2_CTRLBSET_CMD_MASK		0x07
/** @defgroup tcc2_ctrlbset_cmd CMD TCC Command
@{*/
/**@}*/


#define TCC2_CTRLBSET_IDXCMD_SHIFT		3
#define TCC2_CTRLBSET_IDXCMD_MASK		0x03
/** @defgroup tcc2_ctrlbset_idxcmd IDXCMD Ramp Index Command
@{*/
/**@}*/

/** TCC2_CTRLBSET_ONESHOT One-Shot **/
#define TCC2_CTRLBSET_ONESHOT		(1 << 2)
/** TCC2_CTRLBSET_LUPD Lock Update **/
#define TCC2_CTRLBSET_LUPD		(1 << 1)
/** TCC2_CTRLBSET_DIR Counter Direction **/
#define TCC2_CTRLBSET_DIR		(1 << 0)

/**@}*/

/** @defgroup tcc2_syncbusy SYNCBUSY Synchronization Busy
@{*/

/** TCC2_SYNCBUSY_CC3 Compare Channel 3 Busy **/
#define TCC2_SYNCBUSY_CC3		(1 << 11)
/** TCC2_SYNCBUSY_CC2 Compare Channel 2 Busy **/
#define TCC2_SYNCBUSY_CC2		(1 << 10)
/** TCC2_SYNCBUSY_CC1 Compare Channel 1 Busy **/
#define TCC2_SYNCBUSY_CC1		(1 << 9)
/** TCC2_SYNCBUSY_CC0 Compare Channel 0 Busy **/
#define TCC2_SYNCBUSY_CC0		(1 << 8)
/** TCC2_SYNCBUSY_PER Period Busy **/
#define TCC2_SYNCBUSY_PER		(1 << 7)
/** TCC2_SYNCBUSY_WAVE Wave Busy **/
#define TCC2_SYNCBUSY_WAVE		(1 << 6)
/** TCC2_SYNCBUSY_PATT Pattern Busy **/
#define TCC2_SYNCBUSY_PATT		(1 << 5)
/** TCC2_SYNCBUSY_COUNT Count Busy **/
#define TCC2_SYNCBUSY_COUNT		(1 << 4)
/** TCC2_SYNCBUSY_STATUS Status Busy **/
#define TCC2_SYNCBUSY_STATUS		(1 << 3)
/** TCC2_SYNCBUSY_CTRLB Ctrlb Busy **/
#define TCC2_SYNCBUSY_CTRLB		(1 << 2)
/** TCC2_SYNCBUSY_ENABLE Enable Busy **/
#define TCC2_SYNCBUSY_ENABLE		(1 << 1)
/** TCC2_SYNCBUSY_SWRST Swrst Busy **/
#define TCC2_SYNCBUSY_SWRST		(1 << 0)

/**@}*/

/** @defgroup tcc2_fctrla FCTRLA Recoverable Fault A Configuration
@{*/


#define TCC2_FCTRLA_FILTERVAL_SHIFT		24
#define TCC2_FCTRLA_FILTERVAL_MASK		0x0f
/** @defgroup tcc2_fctrla_filterval FILTERVAL Fault A Filter Value
@{*/
/**@}*/


#define TCC2_FCTRLA_BLANKVAL_SHIFT		16
#define TCC2_FCTRLA_BLANKVAL_MASK		0xff
/** @defgroup tcc2_fctrla_blankval BLANKVAL Fault A Blanking Time
@{*/
/**@}*/

/** TCC2_FCTRLA_BLANKPRESC Fault A Blanking Prescaler **/
#define TCC2_FCTRLA_BLANKPRESC		(1 << 15)

#define TCC2_FCTRLA_CAPTURE_SHIFT		12
#define TCC2_FCTRLA_CAPTURE_MASK		0x07
/** @defgroup tcc2_fctrla_capture CAPTURE Fault A Capture Action
@{*/
/**@}*/


#define TCC2_FCTRLA_CHSEL_SHIFT		10
#define TCC2_FCTRLA_CHSEL_MASK		0x03
/** @defgroup tcc2_fctrla_chsel CHSEL Fault A Capture Channel
@{*/
/**@}*/


#define TCC2_FCTRLA_HALT_SHIFT		8
#define TCC2_FCTRLA_HALT_MASK		0x03
/** @defgroup tcc2_fctrla_halt HALT Fault A Halt Mode
@{*/
/**@}*/

/** TCC2_FCTRLA_RESTART Fault A Restart **/
#define TCC2_FCTRLA_RESTART		(1 << 7)

#define TCC2_FCTRLA_BLANK_SHIFT		5
#define TCC2_FCTRLA_BLANK_MASK		0x03
/** @defgroup tcc2_fctrla_blank BLANK Fault A Blanking Mode
@{*/
/**@}*/

/** TCC2_FCTRLA_QUAL Fault A Qualification **/
#define TCC2_FCTRLA_QUAL		(1 << 4)
/** TCC2_FCTRLA_KEEP Fault A Keeper **/
#define TCC2_FCTRLA_KEEP		(1 << 3)

#define TCC2_FCTRLA_SRC_SHIFT		0
#define TCC2_FCTRLA_SRC_MASK		0x03
/** @defgroup tcc2_fctrla_src SRC Fault A Source
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_fctrlb FCTRLB Recoverable Fault B Configuration
@{*/


#define TCC2_FCTRLB_FILTERVAL_SHIFT		24
#define TCC2_FCTRLB_FILTERVAL_MASK		0x0f
/** @defgroup tcc2_fctrlb_filterval FILTERVAL Fault B Filter Value
@{*/
/**@}*/


#define TCC2_FCTRLB_BLANKVAL_SHIFT		16
#define TCC2_FCTRLB_BLANKVAL_MASK		0xff
/** @defgroup tcc2_fctrlb_blankval BLANKVAL Fault B Blanking Time
@{*/
/**@}*/

/** TCC2_FCTRLB_BLANKPRESC Fault B Blanking Prescaler **/
#define TCC2_FCTRLB_BLANKPRESC		(1 << 15)

#define TCC2_FCTRLB_CAPTURE_SHIFT		12
#define TCC2_FCTRLB_CAPTURE_MASK		0x07
/** @defgroup tcc2_fctrlb_capture CAPTURE Fault B Capture Action
@{*/
/**@}*/


#define TCC2_FCTRLB_CHSEL_SHIFT		10
#define TCC2_FCTRLB_CHSEL_MASK		0x03
/** @defgroup tcc2_fctrlb_chsel CHSEL Fault B Capture Channel
@{*/
/**@}*/


#define TCC2_FCTRLB_HALT_SHIFT		8
#define TCC2_FCTRLB_HALT_MASK		0x03
/** @defgroup tcc2_fctrlb_halt HALT Fault B Halt Mode
@{*/
/**@}*/

/** TCC2_FCTRLB_RESTART Fault B Restart **/
#define TCC2_FCTRLB_RESTART		(1 << 7)

#define TCC2_FCTRLB_BLANK_SHIFT		5
#define TCC2_FCTRLB_BLANK_MASK		0x03
/** @defgroup tcc2_fctrlb_blank BLANK Fault B Blanking Mode
@{*/
/**@}*/

/** TCC2_FCTRLB_QUAL Fault B Qualification **/
#define TCC2_FCTRLB_QUAL		(1 << 4)
/** TCC2_FCTRLB_KEEP Fault B Keeper **/
#define TCC2_FCTRLB_KEEP		(1 << 3)

#define TCC2_FCTRLB_SRC_SHIFT		0
#define TCC2_FCTRLB_SRC_MASK		0x03
/** @defgroup tcc2_fctrlb_src SRC Fault B Source
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_wexctrl WEXCTRL Waveform Extension Configuration
@{*/


#define TCC2_WEXCTRL_DTHS_SHIFT		24
#define TCC2_WEXCTRL_DTHS_MASK		0xff
/** @defgroup tcc2_wexctrl_dths DTHS Dead-time High Side Outputs Value
@{*/
/**@}*/


#define TCC2_WEXCTRL_DTLS_SHIFT		16
#define TCC2_WEXCTRL_DTLS_MASK		0xff
/** @defgroup tcc2_wexctrl_dtls DTLS Dead-time Low Side Outputs Value
@{*/
/**@}*/

/** TCC2_WEXCTRL_DTIEN3 Dead-time Insertion Generator 3 Enable **/
#define TCC2_WEXCTRL_DTIEN3		(1 << 11)
/** TCC2_WEXCTRL_DTIEN2 Dead-time Insertion Generator 2 Enable **/
#define TCC2_WEXCTRL_DTIEN2		(1 << 10)
/** TCC2_WEXCTRL_DTIEN1 Dead-time Insertion Generator 1 Enable **/
#define TCC2_WEXCTRL_DTIEN1		(1 << 9)
/** TCC2_WEXCTRL_DTIEN0 Dead-time Insertion Generator 0 Enable **/
#define TCC2_WEXCTRL_DTIEN0		(1 << 8)

#define TCC2_WEXCTRL_OTMX_SHIFT		0
#define TCC2_WEXCTRL_OTMX_MASK		0x03
/** @defgroup tcc2_wexctrl_otmx OTMX Output Matrix
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_drvctrl DRVCTRL Driver Control
@{*/


#define TCC2_DRVCTRL_FILTERVAL1_SHIFT		28
#define TCC2_DRVCTRL_FILTERVAL1_MASK		0x0f
/** @defgroup tcc2_drvctrl_filterval1 FILTERVAL1 Non-Recoverable Fault Input 1 Filter Value
@{*/
/**@}*/


#define TCC2_DRVCTRL_FILTERVAL0_SHIFT		24
#define TCC2_DRVCTRL_FILTERVAL0_MASK		0x0f
/** @defgroup tcc2_drvctrl_filterval0 FILTERVAL0 Non-Recoverable Fault Input 0 Filter Value
@{*/
/**@}*/

/** TCC2_DRVCTRL_INVEN7 Output Waveform 7 Inversion **/
#define TCC2_DRVCTRL_INVEN7		(1 << 23)
/** TCC2_DRVCTRL_INVEN6 Output Waveform 6 Inversion **/
#define TCC2_DRVCTRL_INVEN6		(1 << 22)
/** TCC2_DRVCTRL_INVEN5 Output Waveform 5 Inversion **/
#define TCC2_DRVCTRL_INVEN5		(1 << 21)
/** TCC2_DRVCTRL_INVEN4 Output Waveform 4 Inversion **/
#define TCC2_DRVCTRL_INVEN4		(1 << 20)
/** TCC2_DRVCTRL_INVEN3 Output Waveform 3 Inversion **/
#define TCC2_DRVCTRL_INVEN3		(1 << 19)
/** TCC2_DRVCTRL_INVEN2 Output Waveform 2 Inversion **/
#define TCC2_DRVCTRL_INVEN2		(1 << 18)
/** TCC2_DRVCTRL_INVEN1 Output Waveform 1 Inversion **/
#define TCC2_DRVCTRL_INVEN1		(1 << 17)
/** TCC2_DRVCTRL_INVEN0 Output Waveform 0 Inversion **/
#define TCC2_DRVCTRL_INVEN0		(1 << 16)
/** TCC2_DRVCTRL_NRV7 Non-Recoverable State 7 Output Value **/
#define TCC2_DRVCTRL_NRV7		(1 << 15)
/** TCC2_DRVCTRL_NRV6 Non-Recoverable State 6 Output Value **/
#define TCC2_DRVCTRL_NRV6		(1 << 14)
/** TCC2_DRVCTRL_NRV5 Non-Recoverable State 5 Output Value **/
#define TCC2_DRVCTRL_NRV5		(1 << 13)
/** TCC2_DRVCTRL_NRV4 Non-Recoverable State 4 Output Value **/
#define TCC2_DRVCTRL_NRV4		(1 << 12)
/** TCC2_DRVCTRL_NRV3 Non-Recoverable State 3 Output Value **/
#define TCC2_DRVCTRL_NRV3		(1 << 11)
/** TCC2_DRVCTRL_NRV2 Non-Recoverable State 2 Output Value **/
#define TCC2_DRVCTRL_NRV2		(1 << 10)
/** TCC2_DRVCTRL_NRV1 Non-Recoverable State 1 Output Value **/
#define TCC2_DRVCTRL_NRV1		(1 << 9)
/** TCC2_DRVCTRL_NRV0 Non-Recoverable State 0 Output Value **/
#define TCC2_DRVCTRL_NRV0		(1 << 8)
/** TCC2_DRVCTRL_NRE7 Non-Recoverable State 7 Output Enable **/
#define TCC2_DRVCTRL_NRE7		(1 << 7)
/** TCC2_DRVCTRL_NRE6 Non-Recoverable State 6 Output Enable **/
#define TCC2_DRVCTRL_NRE6		(1 << 6)
/** TCC2_DRVCTRL_NRE5 Non-Recoverable State 5 Output Enable **/
#define TCC2_DRVCTRL_NRE5		(1 << 5)
/** TCC2_DRVCTRL_NRE4 Non-Recoverable State 4 Output Enable **/
#define TCC2_DRVCTRL_NRE4		(1 << 4)
/** TCC2_DRVCTRL_NRE3 Non-Recoverable State 3 Output Enable **/
#define TCC2_DRVCTRL_NRE3		(1 << 3)
/** TCC2_DRVCTRL_NRE2 Non-Recoverable State 2 Output Enable **/
#define TCC2_DRVCTRL_NRE2		(1 << 2)
/** TCC2_DRVCTRL_NRE1 Non-Recoverable State 1 Output Enable **/
#define TCC2_DRVCTRL_NRE1		(1 << 1)
/** TCC2_DRVCTRL_NRE0 Non-Recoverable State 0 Output Enable **/
#define TCC2_DRVCTRL_NRE0		(1 << 0)

/**@}*/

/** @defgroup tcc2_dbgctrl DBGCTRL Debug Control
@{*/

/** TCC2_DBGCTRL_FDDBD Fault Detection on Debug Break Detection **/
#define TCC2_DBGCTRL_FDDBD		(1 << 2)
/** TCC2_DBGCTRL_DBGRUN Debug Running Mode **/
#define TCC2_DBGCTRL_DBGRUN		(1 << 0)

/**@}*/

/** @defgroup tcc2_evctrl EVCTRL Event Control
@{*/

/** TCC2_EVCTRL_MCEO3 Match or Capture Channel 3 Event Output Enable **/
#define TCC2_EVCTRL_MCEO3		(1 << 27)
/** TCC2_EVCTRL_MCEO2 Match or Capture Channel 2 Event Output Enable **/
#define TCC2_EVCTRL_MCEO2		(1 << 26)
/** TCC2_EVCTRL_MCEO1 Match or Capture Channel 1 Event Output Enable **/
#define TCC2_EVCTRL_MCEO1		(1 << 25)
/** TCC2_EVCTRL_MCEO0 Match or Capture Channel 0 Event Output Enable **/
#define TCC2_EVCTRL_MCEO0		(1 << 24)
/** TCC2_EVCTRL_MCEI3 Match or Capture Channel 3 Event Input Enable **/
#define TCC2_EVCTRL_MCEI3		(1 << 19)
/** TCC2_EVCTRL_MCEI2 Match or Capture Channel 2 Event Input Enable **/
#define TCC2_EVCTRL_MCEI2		(1 << 18)
/** TCC2_EVCTRL_MCEI1 Match or Capture Channel 1 Event Input Enable **/
#define TCC2_EVCTRL_MCEI1		(1 << 17)
/** TCC2_EVCTRL_MCEI0 Match or Capture Channel 0 Event Input Enable **/
#define TCC2_EVCTRL_MCEI0		(1 << 16)
/** TCC2_EVCTRL_TCEI1 Timer/counter Event 1 Input Enable **/
#define TCC2_EVCTRL_TCEI1		(1 << 15)
/** TCC2_EVCTRL_TCEI0 Timer/counter Event 0 Input Enable **/
#define TCC2_EVCTRL_TCEI0		(1 << 14)
/** TCC2_EVCTRL_TCINV1 Inverted Event 1 Input Enable **/
#define TCC2_EVCTRL_TCINV1		(1 << 13)
/** TCC2_EVCTRL_TCINV0 Inverted Event 0 Input Enable **/
#define TCC2_EVCTRL_TCINV0		(1 << 12)
/** TCC2_EVCTRL_CNTEO Timer/counter Output Event Enable **/
#define TCC2_EVCTRL_CNTEO		(1 << 10)
/** TCC2_EVCTRL_TRGEO Retrigger Output Event Enable **/
#define TCC2_EVCTRL_TRGEO		(1 << 9)
/** TCC2_EVCTRL_OVFEO Overflow/Underflow Output Event Enable **/
#define TCC2_EVCTRL_OVFEO		(1 << 8)

#define TCC2_EVCTRL_CNTSEL_SHIFT		6
#define TCC2_EVCTRL_CNTSEL_MASK		0x03
/** @defgroup tcc2_evctrl_cntsel CNTSEL Timer/counter Output Event Mode
@{*/
/**@}*/


#define TCC2_EVCTRL_EVACT1_SHIFT		3
#define TCC2_EVCTRL_EVACT1_MASK		0x07
/** @defgroup tcc2_evctrl_evact1 EVACT1 Timer/counter Input Event1 Action
@{*/
/**@}*/


#define TCC2_EVCTRL_EVACT0_SHIFT		0
#define TCC2_EVCTRL_EVACT0_MASK		0x07
/** @defgroup tcc2_evctrl_evact0 EVACT0 Timer/counter Input Event0 Action
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_intenclr INTENCLR Interrupt Enable Clear
@{*/

/** TCC2_INTENCLR_MC3 Match or Capture Channel 3 Interrupt Enable **/
#define TCC2_INTENCLR_MC3		(1 << 19)
/** TCC2_INTENCLR_MC2 Match or Capture Channel 2 Interrupt Enable **/
#define TCC2_INTENCLR_MC2		(1 << 18)
/** TCC2_INTENCLR_MC1 Match or Capture Channel 1 Interrupt Enable **/
#define TCC2_INTENCLR_MC1		(1 << 17)
/** TCC2_INTENCLR_MC0 Match or Capture Channel 0 Interrupt Enable **/
#define TCC2_INTENCLR_MC0		(1 << 16)
/** TCC2_INTENCLR_FAULT1 Non-Recoverable Fault 1 Interrupt Enable **/
#define TCC2_INTENCLR_FAULT1		(1 << 15)
/** TCC2_INTENCLR_FAULT0 Non-Recoverable Fault 0 Interrupt Enable **/
#define TCC2_INTENCLR_FAULT0		(1 << 14)
/** TCC2_INTENCLR_FAULTB Recoverable Fault B Interrupt Enable **/
#define TCC2_INTENCLR_FAULTB		(1 << 13)
/** TCC2_INTENCLR_FAULTA Recoverable Fault A Interrupt Enable **/
#define TCC2_INTENCLR_FAULTA		(1 << 12)
/** TCC2_INTENCLR_DFS Non-Recoverable Debug Fault Interrupt Enable **/
#define TCC2_INTENCLR_DFS		(1 << 11)
/** TCC2_INTENCLR_UFS Non-Recoverable Update Fault Interrupt Enable **/
#define TCC2_INTENCLR_UFS		(1 << 10)
/** TCC2_INTENCLR_ERR Error Interrupt Enable **/
#define TCC2_INTENCLR_ERR		(1 << 3)
/** TCC2_INTENCLR_CNT Counter Interrupt Enable **/
#define TCC2_INTENCLR_CNT		(1 << 2)
/** TCC2_INTENCLR_TRG Retrigger Interrupt Enable **/
#define TCC2_INTENCLR_TRG		(1 << 1)
/** TCC2_INTENCLR_OVF Overflow Interrupt Enable **/
#define TCC2_INTENCLR_OVF		(1 << 0)

/**@}*/

/** @defgroup tcc2_intenset INTENSET Interrupt Enable Set
@{*/

/** TCC2_INTENSET_MC3 Match or Capture Channel 3 Interrupt Enable **/
#define TCC2_INTENSET_MC3		(1 << 19)
/** TCC2_INTENSET_MC2 Match or Capture Channel 2 Interrupt Enable **/
#define TCC2_INTENSET_MC2		(1 << 18)
/** TCC2_INTENSET_MC1 Match or Capture Channel 1 Interrupt Enable **/
#define TCC2_INTENSET_MC1		(1 << 17)
/** TCC2_INTENSET_MC0 Match or Capture Channel 0 Interrupt Enable **/
#define TCC2_INTENSET_MC0		(1 << 16)
/** TCC2_INTENSET_FAULT1 Non-Recoverable Fault 1 Interrupt Enable **/
#define TCC2_INTENSET_FAULT1		(1 << 15)
/** TCC2_INTENSET_FAULT0 Non-Recoverable Fault 0 Interrupt Enable **/
#define TCC2_INTENSET_FAULT0		(1 << 14)
/** TCC2_INTENSET_FAULTB Recoverable Fault B Interrupt Enable **/
#define TCC2_INTENSET_FAULTB		(1 << 13)
/** TCC2_INTENSET_FAULTA Recoverable Fault A Interrupt Enable **/
#define TCC2_INTENSET_FAULTA		(1 << 12)
/** TCC2_INTENSET_DFS Non-Recoverable Debug Fault Interrupt Enable **/
#define TCC2_INTENSET_DFS		(1 << 11)
/** TCC2_INTENSET_UFS Non-Recoverable Update Fault Interrupt Enable **/
#define TCC2_INTENSET_UFS		(1 << 10)
/** TCC2_INTENSET_ERR Error Interrupt Enable **/
#define TCC2_INTENSET_ERR		(1 << 3)
/** TCC2_INTENSET_CNT Counter Interrupt Enable **/
#define TCC2_INTENSET_CNT		(1 << 2)
/** TCC2_INTENSET_TRG Retrigger Interrupt Enable **/
#define TCC2_INTENSET_TRG		(1 << 1)
/** TCC2_INTENSET_OVF Overflow Interrupt Enable **/
#define TCC2_INTENSET_OVF		(1 << 0)

/**@}*/

/** @defgroup tcc2_intflag INTFLAG Interrupt Flag Status and Clear
@{*/

