grevaillot/svd_tools/headers/ATSAMR34J18B/tcc2.h
/** TCC2_INTFLAG_MC3 Match or Capture 3 **/
#define TCC2_INTFLAG_MC3		(1 << 19)
/** TCC2_INTFLAG_MC2 Match or Capture 2 **/
#define TCC2_INTFLAG_MC2		(1 << 18)
/** TCC2_INTFLAG_MC1 Match or Capture 1 **/
#define TCC2_INTFLAG_MC1		(1 << 17)
/** TCC2_INTFLAG_MC0 Match or Capture 0 **/
#define TCC2_INTFLAG_MC0		(1 << 16)
/** TCC2_INTFLAG_FAULT1 Non-Recoverable Fault 1 **/
#define TCC2_INTFLAG_FAULT1		(1 << 15)
/** TCC2_INTFLAG_FAULT0 Non-Recoverable Fault 0 **/
#define TCC2_INTFLAG_FAULT0		(1 << 14)
/** TCC2_INTFLAG_FAULTB Recoverable Fault B **/
#define TCC2_INTFLAG_FAULTB		(1 << 13)
/** TCC2_INTFLAG_FAULTA Recoverable Fault A **/
#define TCC2_INTFLAG_FAULTA		(1 << 12)
/** TCC2_INTFLAG_DFS Non-Recoverable Debug Fault **/
#define TCC2_INTFLAG_DFS		(1 << 11)
/** TCC2_INTFLAG_UFS Non-Recoverable Update Fault **/
#define TCC2_INTFLAG_UFS		(1 << 10)
/** TCC2_INTFLAG_ERR Error **/
#define TCC2_INTFLAG_ERR		(1 << 3)
/** TCC2_INTFLAG_CNT Counter **/
#define TCC2_INTFLAG_CNT		(1 << 2)
/** TCC2_INTFLAG_TRG Retrigger **/
#define TCC2_INTFLAG_TRG		(1 << 1)
/** TCC2_INTFLAG_OVF Overflow **/
#define TCC2_INTFLAG_OVF		(1 << 0)

/**@}*/

/** @defgroup tcc2_status STATUS Status
@{*/

/** TCC2_STATUS_CMP3 Compare Channel 3 Value **/
#define TCC2_STATUS_CMP3		(1 << 27)
/** TCC2_STATUS_CMP2 Compare Channel 2 Value **/
#define TCC2_STATUS_CMP2		(1 << 26)
/** TCC2_STATUS_CMP1 Compare Channel 1 Value **/
#define TCC2_STATUS_CMP1		(1 << 25)
/** TCC2_STATUS_CMP0 Compare Channel 0 Value **/
#define TCC2_STATUS_CMP0		(1 << 24)
/** TCC2_STATUS_CCBUFV3 Compare Channel 3 Buffer Valid **/
#define TCC2_STATUS_CCBUFV3		(1 << 19)
/** TCC2_STATUS_CCBUFV2 Compare Channel 2 Buffer Valid **/
#define TCC2_STATUS_CCBUFV2		(1 << 18)
/** TCC2_STATUS_CCBUFV1 Compare Channel 1 Buffer Valid **/
#define TCC2_STATUS_CCBUFV1		(1 << 17)
/** TCC2_STATUS_CCBUFV0 Compare Channel 0 Buffer Valid **/
#define TCC2_STATUS_CCBUFV0		(1 << 16)
/** TCC2_STATUS_FAULT1 Non-Recoverable Fault 1 State **/
#define TCC2_STATUS_FAULT1		(1 << 15)
/** TCC2_STATUS_FAULT0 Non-Recoverable Fault 0 State **/
#define TCC2_STATUS_FAULT0		(1 << 14)
/** TCC2_STATUS_FAULTB Recoverable Fault B State **/
#define TCC2_STATUS_FAULTB		(1 << 13)
/** TCC2_STATUS_FAULTA Recoverable Fault A State **/
#define TCC2_STATUS_FAULTA		(1 << 12)
/** TCC2_STATUS_FAULT1IN Non-Recoverable Fault1 Input **/
#define TCC2_STATUS_FAULT1IN		(1 << 11)
/** TCC2_STATUS_FAULT0IN Non-Recoverable Fault0 Input **/
#define TCC2_STATUS_FAULT0IN		(1 << 10)
/** TCC2_STATUS_FAULTBIN Recoverable Fault B Input **/
#define TCC2_STATUS_FAULTBIN		(1 << 9)
/** TCC2_STATUS_FAULTAIN Recoverable Fault A Input **/
#define TCC2_STATUS_FAULTAIN		(1 << 8)
/** TCC2_STATUS_PERBUFV Period Buffer Valid **/
#define TCC2_STATUS_PERBUFV		(1 << 7)
/** TCC2_STATUS_PATTBUFV Pattern Buffer Valid **/
#define TCC2_STATUS_PATTBUFV		(1 << 5)
/** TCC2_STATUS_SLAVE Slave **/
#define TCC2_STATUS_SLAVE		(1 << 4)
/** TCC2_STATUS_DFS Non-Recoverable Debug Fault State **/
#define TCC2_STATUS_DFS		(1 << 3)
/** TCC2_STATUS_UFS Non-recoverable Update Fault State **/
#define TCC2_STATUS_UFS		(1 << 2)
/** TCC2_STATUS_IDX Ramp **/
#define TCC2_STATUS_IDX		(1 << 1)
/** TCC2_STATUS_STOP Stop **/
#define TCC2_STATUS_STOP		(1 << 0)

/**@}*/

/** @defgroup tcc2_count COUNT Count
@{*/


#define TCC2_COUNT_COUNT_SHIFT		0
#define TCC2_COUNT_COUNT_MASK		0xffffff
/** @defgroup tcc2_count_count COUNT Counter Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_count_dith4 COUNTDITH4 Count
@{*/


#define TCC2_COUNT_DITH4_COUNT_SHIFT		4
#define TCC2_COUNT_DITH4_COUNT_MASK		0xfffff
/** @defgroup tcc2_count_dith4_count COUNT Counter Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_count_dith5 COUNTDITH5 Count
@{*/


#define TCC2_COUNT_DITH5_COUNT_SHIFT		5
#define TCC2_COUNT_DITH5_COUNT_MASK		0x7ffff
/** @defgroup tcc2_count_dith5_count COUNT Counter Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_count_dith6 COUNTDITH6 Count
@{*/


#define TCC2_COUNT_DITH6_COUNT_SHIFT		6
#define TCC2_COUNT_DITH6_COUNT_MASK		0x3ffff
/** @defgroup tcc2_count_dith6_count COUNT Counter Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_patt PATT Pattern
@{*/

/** TCC2_PATT_PGV7 Pattern Generator 7 Output Value **/
#define TCC2_PATT_PGV7		(1 << 15)
/** TCC2_PATT_PGV6 Pattern Generator 6 Output Value **/
#define TCC2_PATT_PGV6		(1 << 14)
/** TCC2_PATT_PGV5 Pattern Generator 5 Output Value **/
#define TCC2_PATT_PGV5		(1 << 13)
/** TCC2_PATT_PGV4 Pattern Generator 4 Output Value **/
#define TCC2_PATT_PGV4		(1 << 12)
/** TCC2_PATT_PGV3 Pattern Generator 3 Output Value **/
#define TCC2_PATT_PGV3		(1 << 11)
/** TCC2_PATT_PGV2 Pattern Generator 2 Output Value **/
#define TCC2_PATT_PGV2		(1 << 10)
/** TCC2_PATT_PGV1 Pattern Generator 1 Output Value **/
#define TCC2_PATT_PGV1		(1 << 9)
/** TCC2_PATT_PGV0 Pattern Generator 0 Output Value **/
#define TCC2_PATT_PGV0		(1 << 8)
/** TCC2_PATT_PGE7 Pattern Generator 7 Output Enable **/
#define TCC2_PATT_PGE7		(1 << 7)
/** TCC2_PATT_PGE6 Pattern Generator 6 Output Enable **/
#define TCC2_PATT_PGE6		(1 << 6)
/** TCC2_PATT_PGE5 Pattern Generator 5 Output Enable **/
#define TCC2_PATT_PGE5		(1 << 5)
/** TCC2_PATT_PGE4 Pattern Generator 4 Output Enable **/
#define TCC2_PATT_PGE4		(1 << 4)
/** TCC2_PATT_PGE3 Pattern Generator 3 Output Enable **/
#define TCC2_PATT_PGE3		(1 << 3)
/** TCC2_PATT_PGE2 Pattern Generator 2 Output Enable **/
#define TCC2_PATT_PGE2		(1 << 2)
/** TCC2_PATT_PGE1 Pattern Generator 1 Output Enable **/
#define TCC2_PATT_PGE1		(1 << 1)
/** TCC2_PATT_PGE0 Pattern Generator 0 Output Enable **/
#define TCC2_PATT_PGE0		(1 << 0)

/**@}*/

/** @defgroup tcc2_wave WAVE Waveform Control
@{*/

/** TCC2_WAVE_SWAP3 Swap DTI Output Pair 3 **/
#define TCC2_WAVE_SWAP3		(1 << 27)
/** TCC2_WAVE_SWAP2 Swap DTI Output Pair 2 **/
#define TCC2_WAVE_SWAP2		(1 << 26)
/** TCC2_WAVE_SWAP1 Swap DTI Output Pair 1 **/
#define TCC2_WAVE_SWAP1		(1 << 25)
/** TCC2_WAVE_SWAP0 Swap DTI Output Pair 0 **/
#define TCC2_WAVE_SWAP0		(1 << 24)
/** TCC2_WAVE_POL3 Channel 3 Polarity **/
#define TCC2_WAVE_POL3		(1 << 19)
/** TCC2_WAVE_POL2 Channel 2 Polarity **/
#define TCC2_WAVE_POL2		(1 << 18)
/** TCC2_WAVE_POL1 Channel 1 Polarity **/
#define TCC2_WAVE_POL1		(1 << 17)
/** TCC2_WAVE_POL0 Channel 0 Polarity **/
#define TCC2_WAVE_POL0		(1 << 16)
/** TCC2_WAVE_CICCEN3 Circular Channel 3 Enable **/
#define TCC2_WAVE_CICCEN3		(1 << 11)
/** TCC2_WAVE_CICCEN2 Circular Channel 2 Enable **/
#define TCC2_WAVE_CICCEN2		(1 << 10)
/** TCC2_WAVE_CICCEN1 Circular Channel 1 Enable **/
#define TCC2_WAVE_CICCEN1		(1 << 9)
/** TCC2_WAVE_CICCEN0 Circular Channel 0 Enable **/
#define TCC2_WAVE_CICCEN0		(1 << 8)
/** TCC2_WAVE_CIPEREN Circular period Enable **/
#define TCC2_WAVE_CIPEREN		(1 << 7)

#define TCC2_WAVE_RAMP_SHIFT		4
#define TCC2_WAVE_RAMP_MASK		0x03
/** @defgroup tcc2_wave_ramp RAMP Ramp Mode
@{*/
/**@}*/


