grevaillot/svd_tools/headers/ATSAMR34J18B/tcc2.h
#define TCC2_WAVE_WAVEGEN_SHIFT		0
#define TCC2_WAVE_WAVEGEN_MASK		0x07
/** @defgroup tcc2_wave_wavegen WAVEGEN Waveform Generation
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_per PER Period
@{*/


#define TCC2_PER_PER_SHIFT		0
#define TCC2_PER_PER_MASK		0xffffff
/** @defgroup tcc2_per_per PER Period Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_per_dith4 PERDITH4 Period
@{*/


#define TCC2_PER_DITH4_PER_SHIFT		4
#define TCC2_PER_DITH4_PER_MASK		0xfffff
/** @defgroup tcc2_per_dith4_per PER Period Value
@{*/
/**@}*/


#define TCC2_PER_DITH4_DITHER_SHIFT		0
#define TCC2_PER_DITH4_DITHER_MASK		0x0f
/** @defgroup tcc2_per_dith4_dither DITHER Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_per_dith5 PERDITH5 Period
@{*/


#define TCC2_PER_DITH5_PER_SHIFT		5
#define TCC2_PER_DITH5_PER_MASK		0x7ffff
/** @defgroup tcc2_per_dith5_per PER Period Value
@{*/
/**@}*/


#define TCC2_PER_DITH5_DITHER_SHIFT		0
#define TCC2_PER_DITH5_DITHER_MASK		0x1f
/** @defgroup tcc2_per_dith5_dither DITHER Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_per_dith6 PERDITH6 Period
@{*/


#define TCC2_PER_DITH6_PER_SHIFT		6
#define TCC2_PER_DITH6_PER_MASK		0x3ffff
/** @defgroup tcc2_per_dith6_per PER Period Value
@{*/
/**@}*/


#define TCC2_PER_DITH6_DITHER_SHIFT		0
#define TCC2_PER_DITH6_DITHER_MASK		0x3f
/** @defgroup tcc2_per_dith6_dither DITHER Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_cc0 CC0 Compare and Capture
@{*/


#define TCC2_CC0_CC_SHIFT		0
#define TCC2_CC0_CC_MASK		0xffffff
/** @defgroup tcc2_cc0_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_cc0_dith4 CC0DITH4 Compare and Capture
@{*/


#define TCC2_CC0_DITH4_CC_SHIFT		4
#define TCC2_CC0_DITH4_CC_MASK		0xfffff
/** @defgroup tcc2_cc0_dith4_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


#define TCC2_CC0_DITH4_DITHER_SHIFT		0
#define TCC2_CC0_DITH4_DITHER_MASK		0x0f
/** @defgroup tcc2_cc0_dith4_dither DITHER Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_cc0_dith5 CC0DITH5 Compare and Capture
@{*/


#define TCC2_CC0_DITH5_CC_SHIFT		5
#define TCC2_CC0_DITH5_CC_MASK		0x7ffff
/** @defgroup tcc2_cc0_dith5_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


#define TCC2_CC0_DITH5_DITHER_SHIFT		0
#define TCC2_CC0_DITH5_DITHER_MASK		0x1f
/** @defgroup tcc2_cc0_dith5_dither DITHER Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_cc0_dith6 CC0DITH6 Compare and Capture
@{*/


#define TCC2_CC0_DITH6_CC_SHIFT		6
#define TCC2_CC0_DITH6_CC_MASK		0x3ffff
/** @defgroup tcc2_cc0_dith6_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


#define TCC2_CC0_DITH6_DITHER_SHIFT		0
#define TCC2_CC0_DITH6_DITHER_MASK		0x3f
/** @defgroup tcc2_cc0_dith6_dither DITHER Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_cc1 CC1 Compare and Capture
@{*/


#define TCC2_CC1_CC_SHIFT		0
#define TCC2_CC1_CC_MASK		0xffffff
/** @defgroup tcc2_cc1_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_cc1_dith4 CC1DITH4 Compare and Capture
@{*/


#define TCC2_CC1_DITH4_CC_SHIFT		4
#define TCC2_CC1_DITH4_CC_MASK		0xfffff
/** @defgroup tcc2_cc1_dith4_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


#define TCC2_CC1_DITH4_DITHER_SHIFT		0
#define TCC2_CC1_DITH4_DITHER_MASK		0x0f
/** @defgroup tcc2_cc1_dith4_dither DITHER Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_cc1_dith5 CC1DITH5 Compare and Capture
@{*/


#define TCC2_CC1_DITH5_CC_SHIFT		5
#define TCC2_CC1_DITH5_CC_MASK		0x7ffff
/** @defgroup tcc2_cc1_dith5_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


#define TCC2_CC1_DITH5_DITHER_SHIFT		0
#define TCC2_CC1_DITH5_DITHER_MASK		0x1f
/** @defgroup tcc2_cc1_dith5_dither DITHER Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_cc1_dith6 CC1DITH6 Compare and Capture
@{*/


#define TCC2_CC1_DITH6_CC_SHIFT		6
#define TCC2_CC1_DITH6_CC_MASK		0x3ffff
/** @defgroup tcc2_cc1_dith6_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


#define TCC2_CC1_DITH6_DITHER_SHIFT		0
#define TCC2_CC1_DITH6_DITHER_MASK		0x3f
/** @defgroup tcc2_cc1_dith6_dither DITHER Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_cc2 CC2 Compare and Capture
@{*/


#define TCC2_CC2_CC_SHIFT		0
#define TCC2_CC2_CC_MASK		0xffffff
/** @defgroup tcc2_cc2_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_cc2_dith4 CC2DITH4 Compare and Capture
@{*/


#define TCC2_CC2_DITH4_CC_SHIFT		4
#define TCC2_CC2_DITH4_CC_MASK		0xfffff
/** @defgroup tcc2_cc2_dith4_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


#define TCC2_CC2_DITH4_DITHER_SHIFT		0
#define TCC2_CC2_DITH4_DITHER_MASK		0x0f
/** @defgroup tcc2_cc2_dith4_dither DITHER Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_cc2_dith5 CC2DITH5 Compare and Capture
@{*/


#define TCC2_CC2_DITH5_CC_SHIFT		5
#define TCC2_CC2_DITH5_CC_MASK		0x7ffff
/** @defgroup tcc2_cc2_dith5_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


#define TCC2_CC2_DITH5_DITHER_SHIFT		0
#define TCC2_CC2_DITH5_DITHER_MASK		0x1f
/** @defgroup tcc2_cc2_dith5_dither DITHER Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_cc2_dith6 CC2DITH6 Compare and Capture
@{*/


#define TCC2_CC2_DITH6_CC_SHIFT		6
#define TCC2_CC2_DITH6_CC_MASK		0x3ffff
/** @defgroup tcc2_cc2_dith6_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


#define TCC2_CC2_DITH6_DITHER_SHIFT		0
#define TCC2_CC2_DITH6_DITHER_MASK		0x3f
/** @defgroup tcc2_cc2_dith6_dither DITHER Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_cc3 CC3 Compare and Capture
@{*/


#define TCC2_CC3_CC_SHIFT		0
#define TCC2_CC3_CC_MASK		0xffffff
/** @defgroup tcc2_cc3_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_cc3_dith4 CC3DITH4 Compare and Capture
@{*/


#define TCC2_CC3_DITH4_CC_SHIFT		4
#define TCC2_CC3_DITH4_CC_MASK		0xfffff
/** @defgroup tcc2_cc3_dith4_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


#define TCC2_CC3_DITH4_DITHER_SHIFT		0
#define TCC2_CC3_DITH4_DITHER_MASK		0x0f
/** @defgroup tcc2_cc3_dith4_dither DITHER Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_cc3_dith5 CC3DITH5 Compare and Capture
@{*/


#define TCC2_CC3_DITH5_CC_SHIFT		5
#define TCC2_CC3_DITH5_CC_MASK		0x7ffff
/** @defgroup tcc2_cc3_dith5_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


#define TCC2_CC3_DITH5_DITHER_SHIFT		0
#define TCC2_CC3_DITH5_DITHER_MASK		0x1f
/** @defgroup tcc2_cc3_dith5_dither DITHER Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_cc3_dith6 CC3DITH6 Compare and Capture
@{*/


#define TCC2_CC3_DITH6_CC_SHIFT		6
#define TCC2_CC3_DITH6_CC_MASK		0x3ffff
/** @defgroup tcc2_cc3_dith6_cc CC Channel Compare/Capture Value
@{*/
/**@}*/


#define TCC2_CC3_DITH6_DITHER_SHIFT		0
#define TCC2_CC3_DITH6_DITHER_MASK		0x3f
/** @defgroup tcc2_cc3_dith6_dither DITHER Dithering Cycle Number
@{*/
/**@}*/


/**@}*/

