grevaillot/svd_tools/headers/ATSAMR34J18B/tcc2.h
/** @defgroup tcc2_pattbuf PATTBUF Pattern Buffer
@{*/

/** TCC2_PATTBUF_PGVB7 Pattern Generator 7 Output Enable **/
#define TCC2_PATTBUF_PGVB7		(1 << 15)
/** TCC2_PATTBUF_PGVB6 Pattern Generator 6 Output Enable **/
#define TCC2_PATTBUF_PGVB6		(1 << 14)
/** TCC2_PATTBUF_PGVB5 Pattern Generator 5 Output Enable **/
#define TCC2_PATTBUF_PGVB5		(1 << 13)
/** TCC2_PATTBUF_PGVB4 Pattern Generator 4 Output Enable **/
#define TCC2_PATTBUF_PGVB4		(1 << 12)
/** TCC2_PATTBUF_PGVB3 Pattern Generator 3 Output Enable **/
#define TCC2_PATTBUF_PGVB3		(1 << 11)
/** TCC2_PATTBUF_PGVB2 Pattern Generator 2 Output Enable **/
#define TCC2_PATTBUF_PGVB2		(1 << 10)
/** TCC2_PATTBUF_PGVB1 Pattern Generator 1 Output Enable **/
#define TCC2_PATTBUF_PGVB1		(1 << 9)
/** TCC2_PATTBUF_PGVB0 Pattern Generator 0 Output Enable **/
#define TCC2_PATTBUF_PGVB0		(1 << 8)
/** TCC2_PATTBUF_PGEB7 Pattern Generator 7 Output Enable Buffer **/
#define TCC2_PATTBUF_PGEB7		(1 << 7)
/** TCC2_PATTBUF_PGEB6 Pattern Generator 6 Output Enable Buffer **/
#define TCC2_PATTBUF_PGEB6		(1 << 6)
/** TCC2_PATTBUF_PGEB5 Pattern Generator 5 Output Enable Buffer **/
#define TCC2_PATTBUF_PGEB5		(1 << 5)
/** TCC2_PATTBUF_PGEB4 Pattern Generator 4 Output Enable Buffer **/
#define TCC2_PATTBUF_PGEB4		(1 << 4)
/** TCC2_PATTBUF_PGEB3 Pattern Generator 3 Output Enable Buffer **/
#define TCC2_PATTBUF_PGEB3		(1 << 3)
/** TCC2_PATTBUF_PGEB2 Pattern Generator 2 Output Enable Buffer **/
#define TCC2_PATTBUF_PGEB2		(1 << 2)
/** TCC2_PATTBUF_PGEB1 Pattern Generator 1 Output Enable Buffer **/
#define TCC2_PATTBUF_PGEB1		(1 << 1)
/** TCC2_PATTBUF_PGEB0 Pattern Generator 0 Output Enable Buffer **/
#define TCC2_PATTBUF_PGEB0		(1 << 0)

/**@}*/

/** @defgroup tcc2_perbuf PERBUF Period Buffer
@{*/


#define TCC2_PERBUF_PERBUF_SHIFT		0
#define TCC2_PERBUF_PERBUF_MASK		0xffffff
/** @defgroup tcc2_perbuf_perbuf PERBUF Period Buffer Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_perbuf_dith4 PERBUFDITH4 Period Buffer
@{*/


#define TCC2_PERBUF_DITH4_PERBUF_SHIFT		4
#define TCC2_PERBUF_DITH4_PERBUF_MASK		0xfffff
/** @defgroup tcc2_perbuf_dith4_perbuf PERBUF Period Buffer Value
@{*/
/**@}*/


#define TCC2_PERBUF_DITH4_DITHERBUF_SHIFT		0
#define TCC2_PERBUF_DITH4_DITHERBUF_MASK		0x0f
/** @defgroup tcc2_perbuf_dith4_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_perbuf_dith5 PERBUFDITH5 Period Buffer
@{*/


#define TCC2_PERBUF_DITH5_PERBUF_SHIFT		5
#define TCC2_PERBUF_DITH5_PERBUF_MASK		0x7ffff
/** @defgroup tcc2_perbuf_dith5_perbuf PERBUF Period Buffer Value
@{*/
/**@}*/


#define TCC2_PERBUF_DITH5_DITHERBUF_SHIFT		0
#define TCC2_PERBUF_DITH5_DITHERBUF_MASK		0x1f
/** @defgroup tcc2_perbuf_dith5_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_perbuf_dith6 PERBUFDITH6 Period Buffer
@{*/


#define TCC2_PERBUF_DITH6_PERBUF_SHIFT		6
#define TCC2_PERBUF_DITH6_PERBUF_MASK		0x3ffff
/** @defgroup tcc2_perbuf_dith6_perbuf PERBUF Period Buffer Value
@{*/
/**@}*/


#define TCC2_PERBUF_DITH6_DITHERBUF_SHIFT		0
#define TCC2_PERBUF_DITH6_DITHERBUF_MASK		0x3f
/** @defgroup tcc2_perbuf_dith6_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_ccbuf0 CCBUF0 Compare and Capture Buffer
@{*/


#define TCC2_CCBUF0_CCBUF_SHIFT		0
#define TCC2_CCBUF0_CCBUF_MASK		0xffffff
/** @defgroup tcc2_ccbuf0_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_ccbuf0_dith4 CCBUF0DITH4 Compare and Capture Buffer
@{*/


#define TCC2_CCBUF0_DITH4_DITHERBUF_SHIFT		4
#define TCC2_CCBUF0_DITH4_DITHERBUF_MASK		0xfffff
/** @defgroup tcc2_ccbuf0_dith4_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


#define TCC2_CCBUF0_DITH4_CCBUF_SHIFT		0
#define TCC2_CCBUF0_DITH4_CCBUF_MASK		0x0f
/** @defgroup tcc2_ccbuf0_dith4_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_ccbuf0_dith5 CCBUF0DITH5 Compare and Capture Buffer
@{*/


#define TCC2_CCBUF0_DITH5_CCBUF_SHIFT		5
#define TCC2_CCBUF0_DITH5_CCBUF_MASK		0x7ffff
/** @defgroup tcc2_ccbuf0_dith5_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC2_CCBUF0_DITH5_DITHERBUF_SHIFT		0
#define TCC2_CCBUF0_DITH5_DITHERBUF_MASK		0x1f
/** @defgroup tcc2_ccbuf0_dith5_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_ccbuf0_dith6 CCBUF0DITH6 Compare and Capture Buffer
@{*/


#define TCC2_CCBUF0_DITH6_CCBUF_SHIFT		6
#define TCC2_CCBUF0_DITH6_CCBUF_MASK		0x3ffff
/** @defgroup tcc2_ccbuf0_dith6_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC2_CCBUF0_DITH6_DITHERBUF_SHIFT		0
#define TCC2_CCBUF0_DITH6_DITHERBUF_MASK		0x3f
/** @defgroup tcc2_ccbuf0_dith6_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_ccbuf1 CCBUF1 Compare and Capture Buffer
@{*/


#define TCC2_CCBUF1_CCBUF_SHIFT		0
#define TCC2_CCBUF1_CCBUF_MASK		0xffffff
/** @defgroup tcc2_ccbuf1_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_ccbuf1_dith4 CCBUF1DITH4 Compare and Capture Buffer
@{*/


#define TCC2_CCBUF1_DITH4_DITHERBUF_SHIFT		4
#define TCC2_CCBUF1_DITH4_DITHERBUF_MASK		0xfffff
/** @defgroup tcc2_ccbuf1_dith4_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


#define TCC2_CCBUF1_DITH4_CCBUF_SHIFT		0
#define TCC2_CCBUF1_DITH4_CCBUF_MASK		0x0f
/** @defgroup tcc2_ccbuf1_dith4_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_ccbuf1_dith5 CCBUF1DITH5 Compare and Capture Buffer
@{*/


#define TCC2_CCBUF1_DITH5_CCBUF_SHIFT		5
#define TCC2_CCBUF1_DITH5_CCBUF_MASK		0x7ffff
/** @defgroup tcc2_ccbuf1_dith5_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC2_CCBUF1_DITH5_DITHERBUF_SHIFT		0
#define TCC2_CCBUF1_DITH5_DITHERBUF_MASK		0x1f
/** @defgroup tcc2_ccbuf1_dith5_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_ccbuf1_dith6 CCBUF1DITH6 Compare and Capture Buffer
@{*/


#define TCC2_CCBUF1_DITH6_CCBUF_SHIFT		6
#define TCC2_CCBUF1_DITH6_CCBUF_MASK		0x3ffff
/** @defgroup tcc2_ccbuf1_dith6_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC2_CCBUF1_DITH6_DITHERBUF_SHIFT		0
#define TCC2_CCBUF1_DITH6_DITHERBUF_MASK		0x3f
/** @defgroup tcc2_ccbuf1_dith6_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_ccbuf2 CCBUF2 Compare and Capture Buffer
@{*/


#define TCC2_CCBUF2_CCBUF_SHIFT		0
#define TCC2_CCBUF2_CCBUF_MASK		0xffffff
/** @defgroup tcc2_ccbuf2_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_ccbuf2_dith4 CCBUF2DITH4 Compare and Capture Buffer
@{*/


