grevaillot/svd_tools/headers/ATSAMR34J18B/tcc2.h
#define TCC2_CCBUF2_DITH4_DITHERBUF_SHIFT		4
#define TCC2_CCBUF2_DITH4_DITHERBUF_MASK		0xfffff
/** @defgroup tcc2_ccbuf2_dith4_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


#define TCC2_CCBUF2_DITH4_CCBUF_SHIFT		0
#define TCC2_CCBUF2_DITH4_CCBUF_MASK		0x0f
/** @defgroup tcc2_ccbuf2_dith4_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_ccbuf2_dith5 CCBUF2DITH5 Compare and Capture Buffer
@{*/


#define TCC2_CCBUF2_DITH5_CCBUF_SHIFT		5
#define TCC2_CCBUF2_DITH5_CCBUF_MASK		0x7ffff
/** @defgroup tcc2_ccbuf2_dith5_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC2_CCBUF2_DITH5_DITHERBUF_SHIFT		0
#define TCC2_CCBUF2_DITH5_DITHERBUF_MASK		0x1f
/** @defgroup tcc2_ccbuf2_dith5_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_ccbuf2_dith6 CCBUF2DITH6 Compare and Capture Buffer
@{*/


#define TCC2_CCBUF2_DITH6_CCBUF_SHIFT		6
#define TCC2_CCBUF2_DITH6_CCBUF_MASK		0x3ffff
/** @defgroup tcc2_ccbuf2_dith6_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC2_CCBUF2_DITH6_DITHERBUF_SHIFT		0
#define TCC2_CCBUF2_DITH6_DITHERBUF_MASK		0x3f
/** @defgroup tcc2_ccbuf2_dith6_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_ccbuf3 CCBUF3 Compare and Capture Buffer
@{*/


#define TCC2_CCBUF3_CCBUF_SHIFT		0
#define TCC2_CCBUF3_CCBUF_MASK		0xffffff
/** @defgroup tcc2_ccbuf3_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_ccbuf3_dith4 CCBUF3DITH4 Compare and Capture Buffer
@{*/


#define TCC2_CCBUF3_DITH4_DITHERBUF_SHIFT		4
#define TCC2_CCBUF3_DITH4_DITHERBUF_MASK		0xfffff
/** @defgroup tcc2_ccbuf3_dith4_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


#define TCC2_CCBUF3_DITH4_CCBUF_SHIFT		0
#define TCC2_CCBUF3_DITH4_CCBUF_MASK		0x0f
/** @defgroup tcc2_ccbuf3_dith4_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_ccbuf3_dith5 CCBUF3DITH5 Compare and Capture Buffer
@{*/


#define TCC2_CCBUF3_DITH5_CCBUF_SHIFT		5
#define TCC2_CCBUF3_DITH5_CCBUF_MASK		0x7ffff
/** @defgroup tcc2_ccbuf3_dith5_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC2_CCBUF3_DITH5_DITHERBUF_SHIFT		0
#define TCC2_CCBUF3_DITH5_DITHERBUF_MASK		0x1f
/** @defgroup tcc2_ccbuf3_dith5_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/

/** @defgroup tcc2_ccbuf3_dith6 CCBUF3DITH6 Compare and Capture Buffer
@{*/


#define TCC2_CCBUF3_DITH6_CCBUF_SHIFT		6
#define TCC2_CCBUF3_DITH6_CCBUF_MASK		0x3ffff
/** @defgroup tcc2_ccbuf3_dith6_ccbuf CCBUF Channel Compare/Capture Buffer Value
@{*/
/**@}*/


#define TCC2_CCBUF3_DITH6_DITHERBUF_SHIFT		0
#define TCC2_CCBUF3_DITH6_DITHERBUF_MASK		0x3f
/** @defgroup tcc2_ccbuf3_dith6_ditherbuf DITHERBUF Dithering Buffer Cycle Number
@{*/
/**@}*/


/**@}*/
